# GetRect3D

## Description
Procedure GetRect3D draws a temporary &amp;quot;rubberband&amp;quot; 3D rectangle on the working plane. The user defines the rectangle by selecting two points which define the top left and bottom right of the rectangle. This cannot be used if there is a function anywhere in the calling chain.

```pascal
PROCEDURE GetRect3D(
				VAR p1 : REAL;
				VAR p2 : REAL;
				useWP  : BOOLEAN);
```

```python

def vs.GetRect3D(useWP):
    return (p1, p2)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p1|REAL|Returns coordinates of first user click.|
|p2|REAL|Returns coordinates of second user click.|
|useWP|BOOLEAN|TRUE if the returned point have to be on the active Working Plane. Snapping to arbitrary 3D geometry will produce vertical projection result on the WP; FALSE if the point can be arbitrary 3D point (produced, for example, by snapping to a 3D geometry)|

## See Also
VS Functions:
GetPt| GetPtL| GetLine| GetRect| GetPt3D| GetPtL3D| GetLine3D| GetRect3D

## Version
Availability: from Vectorworks 2010
## Category
* User Interactive